Пансион83/src/DataProcessors/МастерЗаполненияСвойствНомеров/МастерЗаполненияСвойствНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МастерЗаполненияСвойствНомеров</name>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rooms</name>
    <attributes>
      <name>Room</name>
      <type>
        <types>CatalogRef.НомернойФонд</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RoomProperties</name>
    <attributes>
      <name>RoomProperty</name>
      <type>
        <types>CatalogRef.СвойстваНомеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Пансион83/src/InformationRegisters/СвойстваНомеров/СвойстваНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваНомеров</name>
  <resources>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Author</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>Room</name>
    <comment>Номер</comment>
    <type>
      <types>CatalogRef.НомернойФонд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RoomProperty</name>
    <type>
      <types>CatalogRef.СвойстваНомеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/DataProcessors/МастерЗаполненияСвойствНомеров/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура pmExecute() Экспорт
	For Each vRoomsRow In Rooms Do
		If ЗначениеЗаполнено(vRoomsRow.Room) Тогда
			vProps = InformationRegisters.СвойстваНомеров.CreateRecordSet();
			vProps.Filter.НомерРазмещения.Set(vRoomsRow.Room);
			For Each vRow In RoomProperties Do
				If ЗначениеЗаполнено(vRow.RoomProperty) Тогда
					vPropsRec = vProps.Add();
					vPropsRec.НомерРазмещения = vRoomsRow.ГруппаНомеров;
					vPropsRec.RoomProperty = vRow.RoomProperty;
					vPropsRec.Примечания = vRow.RoomProperty.Remarks;
					vPropsRec.Автор = ПараметрыСеанса.ТекПользователь;
				EndIf;
			EndDo;
			If RoomProperties.Count() > 0 Тогда
				vProps.Write(False);
			Else
				vProps.Clear();
				vProps.Write(True);
			EndIf;
		EndIf;
	EndDo;
КонецПроцедуры //pmExecute
